---
kind: method
id: M:Autodesk.Revit.DB.ExtensibleStorage.Entity.ReadAccessGranted
source: html/48da6574-2d80-d7da-b05d-9743a71e93c6.htm
---
# Autodesk.Revit.DB.ExtensibleStorage.Entity.ReadAccessGranted Method

Checks whether this Entity may be retrieved by the current add-in.

## Syntax (C#)
```csharp
public bool ReadAccessGranted()
```

## Returns
True if read access is allowed.